{
  "backend": "tokenizers",
  "bos_token": "<s>",
  "eos_token": "</s>",
  "mask_token": "<mask>",
  "model_max_length": 256,
  "pad_token": "<pad>",
  "padding_side": "right",
  "tokenizer_class": "TokenizersBackend",
  "truncation_side": "right",
  "unk_token": "<unk>"
}
